#===================================================== ОБЩИЕ НАСТРОЙКИ ===============================================================

api_id = "14107984"
api_hash = "6507fadc1d76c1d8f3c0957690d9ec86"
#======================================================================================================================================






#=============================================== НАСТРОЙКИ ПОД ПЕРВЫЙ КАНАЛ ==========================================================
channel1_link = "https://t.me/test31312" # Ссылка на канал
delay_beetwen_random1 = 100 # То, за какое время отработают все аккаунты
# Процентное соотношение по промежуткам (Какой процент аккаунтов отработает, в течениие одной из четвертей всего delay_beetwen_random)
fst1 = 2
sec1 = 2
tth1 = 2
fth1 = 2
fst1_to = 3
sec1_to = 3
tth1_to = 3
fth1_to = 3


emodji_list1 = ["👍", "🤔", "🤯", "🤬"] # Набор эмодзи для нерекламных постов
emodji_list_advert1 = ["👍", "🤔", "🤯", "🤬"] # Эмодзи для рекламных постов
emodji_wieghts1 = [35, 25, 15, 15] # Веса для эмодзи (Чем больше вес - тем больше вероятность того что эмоция выставится)
emodji_wieghts_advert1 = [35, 25, 15, 15]

advert_rand_from1 = 2 # Дополнительный разброс рандома для реакций рекламных постов в промежутках (ОТ)
advert_rand_to1 = 6 # Дополнительный разброс рандома для реакций рекламных постов в промежутках (ДО)
#======================================================================================================================================

# Для отстальных каналов настройки такие же



#=============================================== НАСТРОЙКИ ПОД ВТОРОЙ КАНАЛ ===========================================================
channel2_link = "https://t.me/matchbot123456" # Ссылка на канал
delay_beetwen_random2 = 100 # То, за какое время отработают все аккаунты
# Процентное соотношение по промежуткам (Какой процент аккаунтов отработает, в течениие одной из четвертей всего delay_beetwen_random)
fst2 = 2
sec2 = 2
tth2 = 2
fth2 = 2
fst2_to = 3
sec2_to = 3
tth2_to = 3
fth2_to = 3


emodji_list2 = ["👍", "🤔", "🤯", "🤬"] # Набор эмодзи для нерекламных постов
emodji_list_advert2 = ["👍", "🤔", "🤯", "🤬"] # Эмодзи для рекламных постов
emodji_wieghts2 = [35, 25, 15, 15] # Веса для эмодзи (Чем больше вес - тем больше вероятность того что эмоция выставится)
emodji_wieghts_advert2 = [35, 25, 15, 15]

advert_rand_from2 = 2 # Дополнительный разброс рандома для реакций рекламных постов в промежутках (ОТ)
advert_rand_to2 = 4 # Дополнительный разброс рандома для реакций рекламных постов в промежутках (ДО)
#======================================================================================================================================





#=============================================== НАСТРОЙКИ ПОД ТРЕТИЙ КАНАЛ ==========================================================
channel3_link = "https://t.me/testing1441" # Ссылка на канал
delay_beetwen_random3 = 100 # То, за какое время отработают все аккаунты
# Процентное соотношение по промежуткам (Какой процент аккаунтов отработает, в течениие одной из четвертей всего delay_beetwen_random)
fst3 = 2
sec3 = 2
tth3 = 2
fth3 = 2
fst3_to = 3
sec3_to = 3
tth3_to = 3
fth3_to = 3


emodji_list3 = ["👍", "🤔", "🤯", "🤬"] # Набор эмодзи для нерекламных постов
emodji_list_advert3 = ["👍", "🤔", "🤯", "🤬"] # Эмодзи для рекламных постов
emodji_wieghts3 = [35, 25, 15, 15] # Веса для эмодзи (Чем больше вес - тем больше вероятность того что эмоция выставится)
emodji_wieghts_advert3 = [35, 25, 15, 15]

advert_rand_from3 = 3 # Дополнительный разброс рандома для реакций рекламных постов в промежутках (ОТ)
advert_rand_to3 = 6 # Дополнительный разброс рандома для реакций рекламных постов в промежутках (ДО)
#======================================================================================================================================